#!/usr/bin/perl -w -CS
package mk::flood;
use strict;
use v5.16;
use utf8;

my @startphonemes=(
	[split('','аеиоуаеиоуаеиоуаеиоуаеиоуаеиоуаеиоуаеиоуаеиоуяаеиоуюяэоай'),qw/ей ой уй яй/],
	[split('','бвгджзклмнпрстфхцчшщбвгджзклмнпрстфхцчшбвгджзклмнпрстхцчшбвгджзклмнпрстхбвгджзклмнпрстхцчшбвгджзклмнпрстх'),qw/сп ст ср мн гд дж дз ск сл тр спр сн кв зм зк зн кл кр бл вл/]
);

my @phonemes=(
	[split('','аеиоуаеиоуаеиоаеиоаеиоуаеиоуаеиоаеиоаеиоаеиоуыяаеиоуыяаеиоуюыяаеиоаеиоаеиоаеиоуаеиоуаеиоаеиоаеиоаеиоуаеиоуыяаеиоуыяаеиоуюыяэо'),qw/ай ей ий ый ой уй юй яй/],
	[split '','бвгдклмнпрстфхцчшщбвгдклмнпрстфхцчшщбвгдклмнпрстхбвгдклмнпрстфхцчшщбвгдклмнпрстфхцчшщбвгдклмнпрстхбвгдзклмнпрстхбвгдзклмнпрстхбвгджзклмнпрстхбвгджзклмнпрстхбвгджзклмнпрстхбвгджзклмнпрстхбвгджзклмнпрстх'],
	[qw/сп ст ср мн гд дж дз ск сл рн рм тр мт мп спр шт шн шм гн скр ськ сьм рд рт нн кк лл кр бл вл льт льс льм льк льб льв льг льд лт зб хм лх зд кс бр пр кв зм зк зн нз сн/]
);
my @endphonemes=(
	[split('','аиоыаиоыаиоыаиоыаиоыаиоуаиоуыяаиоуыяаиоуыяаиоаиоаиоаеиоуаеиоуаеиоаиоаиоаиоуаеиоуыяаеиоуыяаеиоуыяэ'),qw/эй ай ей ий ый ой уй ий ый ой уй ий ый ой уй/ ],
	[split('','бвгдклмнпрстфхцчшщбвгдклмнпрстфхцчшщбвгдклмнпрстхбвгдклмнпрстфхцчшщбвгдклмнпрстфхцчшщбвгдклмнпрстхбвгдзклмнпрстхбвгдзклмнпрстхбвгджзклмнпрстхбвгджзклмнпрстхбвгджзклмнпрстхбвгджзклмнпрстхбвгджзклмнпрстх'),qw/сп ст дж дз ск рн рм кл мт шт шн шм скр ськ сьм льт льс льм льк льб льг льд рд рт льдс дс лт зб хм лх зд кс бр пр кв зм зк зн нз сн нс мс/]
);

sub genword{
	my $l= 4+int rand 4;	#Min and max phonemes
	my $x= int rand 2;	#Starting from a vowel or a consonant
	my $result = '';
	for my $x (1..$l){
		my $bucket = $phonemes[$x%2];
		if($x==1){
			$bucket = $startphonemes[$x%2];
		}elsif($x==($l-1)) {
			$bucket = $endphonemes[$x%2];
		}
		@_=@$bucket;
		$result.=$_[rand @_];
	}
	return $result;
}
sub phrase{
	my $l=shift||1;
	my $r='';
	for(1..$l){
		my $c=substr '    ,.!!??',int rand 10,1;
		$r.=&genword.$c;
	}
	$r=~s/([,\.!\?])/$1 /g;
	$r=~s/[\.,]?\s+$//;
	return $r;
}
1;#say phrase(1);
